app/controllers/songs_controller.rb

  def new
    # if user goes through /artists/1/songs/new for example, but the artist
    # doesn't exist, redirect to list of artists.
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT "artists".* FROM "artists"

  def edit
    # if user goes through /artists/1/songs/3/edit for example
    if params[:artist_id]
      @artist_given = true # used in a helper to tell if the user went through the nested route

      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil? # if there is no artist matching the given id, return to artists index
        redirect_to artists_path, alert: "Artist not found."
      else # otherwise find the given song by the given artist
        @song = artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]